% ==========位置解析＝＝＝＝＝＝＝＝＝＝
% 
% 2016-05-08 16:33%位置解析
%posi_ana.m

function[x,d,q,Aq] = posi_ana (x0, t);

%運動学拘束式の要素
z1 = x0(1) - 1.5*cos(x0(3)); %運動学拘束式の1行目
z2 = x0(2) - 1.5*sin(x0(3)); %運動学拘束式の2行目
z3 = x0(4) - 1.5*cos(x0(3)) - 2*cos(x0(6)); %運動学拘束式の3行目
z4 = x0(5) - 1.5*sin(x0(3)) - 2*sin(x0(6)); %運動学拘束式の4行目
z5 = x0(5) + 1; %運動学拘束式の5行目
z6 = x0(3) - (pi/6)*t - (5*pi/3); %運動学拘束式の6行目

%ヤコビ行列の要素
a1 = [ 1, 0, (3*sin(x3))/2, 0, 0, 0]; %ヤコビ行列の1行目
a2 = [ 0, 1, -(3*cos(x3))/2, 0, 0, 0]; %ヤコビ行列の2行目
a3 = [ 0, 0, (3*sin(x3))/2 + 1, 0, 0, 2*sin(x6)]; %ヤコビ行列の3行目
a4 = [ 0, 0, -(3*cos(x3))/2, 0, 1, -2*cos(x6)]; %ヤコビ行列の4行目
a5 = [ 0, 0, 0, 0, 1, 0]; %ヤコビ行列の5行目
a6 = [ 0, 0, 1, 0, 0, 0]; %ヤコビ行列の6行目

A = -[z1; z2; z3; z4; z5; z6]; %運動学拘束式
Aq = [a1; a2; a3; a4; a5; a6]; %ヤコビ行列
dx = Aq\A;
x = x0 + dx;
[d] = max(abs(dx));
b = [z1; z2; z3; z4; z5; z6];
[q] = max(abs(b)); 